{
	"1": "Pedophiles are fucking immature assholes",
	"2": "My Grandpa said, 'Your generation relies too much on technology!' I replied, 'No, your generation relies too much on technology!' Then I unplugged his life support.",
	"3": "What's the difference between a woman and a computer? You can punch information into a computer.",
	"4": "Jesus Christ fed 2,000 people with 5 loaves of bread and 2 fish, but Adolf Hitler made 6 million Jews toast.",
	"5": "What's the worst thing about breaking up with a Japanese girl? You have to drop the bomb twice before she gets the message.",
	"6": "How do you get a gay guy to fuck a woman? Shit in her cunt.",
	"7": "What did the boy with no hands get for Christmas? GLOVES! Nah, just kidding... He still hasn't unwrapped his present.",
	"8": "How do Ethiopians celebrate their kids first birthday? By putting flowers on the grave.",
	"9": "How did Rihanna find out Chris Brown was cheating on her? She found another woman's lipstick on his knuckles.",
	"10": "How can you tell if your wife is dead? The sex is the same but the dishes start piling up.",
	"11": "Why do Mexicans never have Sex Ed and Driver's Ed on the same day? They have to give the donkey a break at some point.",
	"12": "Feminism.",
	"13": "So I suggested to my wife that she'd look sexier with her hair back… Which is apparently an insensitive thing to say to a cancer patient.",
	"14": "How did Hitler kill so many Jews? Free transportation.",
	"15": "How many feminists does it take to change a light bulb? Don't be stupid, feminists can't change anything.",
	"16": "What is a pedophiles favorite part about Halloween? Free delivery.",
	"17": "So I painted my laptop black, hoping it would run faster… Now it doesn't work.",
	"18": "Say what you want about pedophiles but they do drive slower through school zones.",
	"19": "What's the difference between a gay man and a freezer? A freezer doesn't fart when you pull the meat out.",
	"20": "What do you tell a woman with two black eyes? Nothing you already done told her twice.",
	"21": "What's white on top and black on bottom? US culture.",
	"22": "Why do Jews have big noses? Because air is free.",
	"23": "What happened when the Jew walked into the wall with a hard-on? He broke his nose.",
	"24": "How long does it take for a black woman to take a shit? Nine months.",
	"25": "How do you get a nun pregnant? Dress her up like an altar boy.",
	"26": "How many Jews can you fit into a car? 2 in the front, 3 in the back, and 5,999,995 in the ashtray.",
	"27": "How many women does it take to screw in a lightbulb? None, they just sit in the dark and bitch.",
	"28": "What do spinach and anal sex have in common? If you were forced to have it as a kid, you'll hate it as an adult.",
	"29": "What's the worst thing about being black and Jewish? Having to sit in the back of the oven.",
	"30": "What's a pedophile's favorite part of a hockey game? Before the First Period.",
	"31": "How do you swat 200 flies at one time? Hit an Ethiopian in the face with a frying pan.",
	"32": "What's black and blue and doesn't like to have sex? The 9-year-old girl in my basement.",
	"33": "How many feminists does it take to change a light bulb? One, she just holds the bulb to the socket and waits for the world to revolve around her.",
	"34": "What's the difference between jelly and jam? I can't jelly my dick down a baby's throat.",
	"35": "Why does Stephen Hawking do one-liners? Because he can't do stand up.",
	"36": "Did you hear the Score of the Egypt vs Ethiopia soccer game? Egypt 8, Ethiopia didn't.",
	"37": "How many cops does it take to change a light bulb? They don't. They arrest the bulb for being broke and beat the room for being black.",
	"38": "What's 9 inches long, pink, and makes my girlfriend scream when I put it in her mouth? Her miscarriage.",
	"39": "What's the hardest part of eating bald pussy? Getting the diaper back on.",
	"40": "What's difference between dollars and Jews? I'd give a shit if I lost 6 million dollars.",
	"41": "9 out of 10 people enjoy gang rape.",
	"42": "What's the best part about fucking a 12-year-old girl? If you flip her over she looks like her little brother.",
	"43": "What do you get when you cross goat DNA with human DNA? You get kicked out of the petting zoo.",
	"44": "I don't understand why Obama has to give his speeches behind bullet proof glass. I mean, I know he's black and all, but I doubt he'll shoot anyone.",
	"45": "What's the difference between a Jew and Harry Potter? Harry can escape the chamber.",
	"46": "What do you call a woman who thinks she can do anything a man can do? Wrong.",
	"47": "What's the difference between black people and snow tires? A: A snow tire doesn't sing when you put chains on it.",
	"48": "What's the difference between cancer and black people? Cancer got Jobs.",
	"49": "What do Sarah Palin and Iron Man have in common? They both had a Downey Jr. inside of them.",
	"50": "A black, a Muslim and a Mexican jump off a cliff to see who gets to the bottom first. Who wins? Society."
}